app/Controllers/KanbanController.php

SELECT COUNT(*) AS `numrows` FROM `tickets`
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `status` LIKE '%s01%' ESCAPE '!'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `status` LIKE '%s02%' ESCAPE '!'
OR  `status` LIKE '%s03%' ESCAPE '!'
OR  `status` LIKE '%s04%' ESCAPE '!'
OR  `status` LIKE '%s06%' ESCAPE '!'
OR  `status` LIKE '%s07%' ESCAPE '!'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `status` LIKE '%s05%' ESCAPE '!'
OR  `status` LIKE '%s08%' ESCAPE '!'
SELECT *
FROM `tickets`
WHERE `status` = 's01'
ORDER BY `id` DESC
SELECT *
FROM `tickets`
WHERE `status` = 's02'
ORDER BY `id` DESC
SELECT *
FROM `tickets`
WHERE `status` = 's03'
ORDER BY `id` DESC
---
    public function index()
    {
        $tickets = model(Ticket::class);

        $db = \Config\Database::connect();
        $total = $db->table('tickets')->countAll();

        $ticketsNoIniciados = $db->table('tickets')->like('status', 's01')->countAllResults();

        $ticketsEnSeguimiento = $db->table('tickets')
            ->like('status', 's02')
            ->orLike('status', 's03')
            ->orLike('status', 's04')
            ->orLike('status', 's06')
            ->orLike('status', 's07')
            ->countAllResults();
        $ticketsCerrados = $db->table('tickets')->like('status', 's05')
            ->orLike('status', 's08')->countAllResults();

        $data = [
            'title' => 'Kanban',
            'totalTickets' => $total,
            'ticketsNoIniciados' => $ticketsNoIniciados,
            'ticketsEnSeguimiento' => $ticketsEnSeguimiento,
            'ticketsCerrados' => $ticketsCerrados,
            'ts01'   => $tickets->where('status', 's01')->orderBy('id', 'desc')->findAll(),
            'ts02'   => $tickets->where('status', 's02')->orderBy('id', 'desc')->findAll(),
            'ts03'   => $tickets->where('status', 's03')->orderBy('id', 'desc')->findAll(),