app/Controllers/TicketController.php

SELECT COUNT(*) AS `numrows` FROM `tickets`
SELECT *
FROM `status`
JOIN `tickets` ON `tickets`.`status`=`status`.`id`
SELECT *
FROM `tickets`
ORDER BY `id` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();
        $total = $db->table('tickets')->countAll();
        $tickets = model('Ticket');

        $builder = $db->table('status');
        $builder->join('tickets', 'tickets.status=status.id');
        $status = $builder->get();
        // $status = $builder->where('status.id', 'ASC')->get();

        $data = [
            'title'     => 'Tickets de soporte',
            'total'     => $total,
            'status'    => $status,
            // // 'tickets'   => $tickets->findAll(),
            // 'tickets'   => $tickets->orderBy('status', 'ASC')->findAll()
            'tickets'   => $tickets->orderBy('id', 'desc')->findAll(),

SELECT *
FROM `status`
SELECT *
FROM `priorities`
SELECT *
FROM `categories`
SELECT *
FROM `areas`
---
    public function new()
    {
        $categories = model('Categoria');
        $priorities = model('Prioridad');
        $status = model('Status');
        $areas = model('Area');

        $data = [
            'title'         => 'Nuevo ticket de soporte',
            'status'        => $status->findAll(),
            'priorities'    => $priorities->findAll(),
            'categories'    => $categories->findAll(),
            'areas'         => $areas->findAll()